def print_dafo():  # 函数不好理解   这个是定义函数
	for i in range(0,3):  #这个是用 for 在定义函数里循环三次
		for a in range(1,10):
			for q in range(1,a+1):
				print("%d*%d=%d"%(q,a,q*a),end="\t")
			print("")
		print("                       oOoo ")
		print("                    o8888888o ")
		print("                     88 . 88 ")
		print("                    (| -_- |) ")
		print("                     O\\ = /O ")
		print("                 ____/`---'\\____ ")
		print("                . ' \\| |// `. ")
		print("                 / \\||| : |||// \\ ")
		print("               / _||||| -:- |||||- \\ ")
		print("                 | | \\\\\\ - /// | | ")
		print("               | \\_| ''\\---/'' | | ")
		print("                \\ .-\\__ `-` ___/-. / ")
		print("         ___    `. .' /--.--\\ `. . __ ")
		print("          ."" '< `.___\\_<|>_/___.' >'"". ")
		print("        | | : `- \\`.;`\\ _ /`;.`/ - ` : | | ")
		print("         \\ \\ `-. \\_ __\\ /__ _/ .-` / / ")
		print("  ======`-.____`-.___\\_____/___.-`____.-'====== ")
		print(" `=---=' ")
		print(" ")
		print(" ............................................. ")
		print("      佛祖镇楼 BUG辟易 ")
		print("      佛曰: ")
		print("      写字楼里写字间，写字间里程序员； ")
		print("      程序人员写程序，又拿程序换酒钱。 ")
		print("      酒醒只在网上坐，酒醉还来网下眠； ")
		print("      酒醉酒醒日复日，网上网下年复年。 ")
		print("      但愿老死电脑间，不愿鞠躬老板前； ")
		print("      奔驰宝马贵者趣，公交自行程序员。 ")
		print("      别人笑我忒疯癫，我笑自己命太贱； ")
		print("      不见满街漂亮妹，哪个归得程序员？")

	a = 0
	b = 0
	c = 0
	for i in range(1,101,1):
		if i%2 == 0:
			a += i	
		if i%2 !=0:
			b += i
		c += i
	print(a) 
	print(b)
	print(c)


print_dafo()      #这个是  调用函数
